### Resampling pada data deret waktu

## Import Modul

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

### Persiapan Data Frame

In [3]:
n_rows =365*24  # Jumlah Baris 24 = Jumlah jam per hari 365= Jumlah Hari untuk membentuk data Waktu 
n_cols =2
cols=['col1','col2'] 

df=pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),
               columns =cols)## Data bertipe integer dan acak 

df.index =pd.util.testing.makeDateIndex(n_rows,freq='H') # Jumlah waktu sesuai dengan baris yang dimiliki
# H sesuai Jam
df

E:\Anaconda\lib\site-packages\pandas\util\__init__.py:8: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                     col1  col2
2000-01-01 00:00:00    15     9
2000-01-01 01:00:00    19     4
2000-01-01 02:00:00    10     5
2000-01-01 03:00:00    10     1
2000-01-01 04:00:00     3     2
...                   ...   ...
2000-12-30 19:00:00    15    14
2000-12-30 20:00:00    17    18
2000-12-30 21:00:00     6     4
2000-12-30 22:00:00     2     5
2000-12-30 23:00:00     9    11

[8760 rows x 2 columns]

### Resampling data dengan interval Monthly

In [4]:
df.resample('M')['col1'].sum().to_frame()
# fungsi resample mengubah H menjadi M (Jam menjadi Bulan)

            col1
2000-01-31  7446
2000-02-29  6950
2000-03-31  7397
2000-04-30  7315
2000-05-31  7524
2000-06-30  7231
2000-07-31  7460
2000-08-31  7511
2000-09-30  7214
2000-10-31  7345
2000-11-30  7426
2000-12-31  7178

### Resampling dengan interval daily

In [5]:
df.resample('D')['col1'].sum().to_frame()

            col1
2000-01-01   247
2000-01-02   216
2000-01-03   268
2000-01-04   252
2000-01-05   199
...          ...
2000-12-26   220
2000-12-27   235
2000-12-28   224
2000-12-29   273
2000-12-30   253

[365 rows x 1 columns]